Repository: federicoviceconti/federicoviceconti_website_code
Catalog: languages/app_*.arb
Languages: it

# touchLogo
source: You are now {stepRemaining} step away!
it: Ancora altri {0} tocchi per vedere la magia!

# sayHelloToMail
source: Say hello to viceconti.federico@gmail.com {emoji}
it: Contattami! 👋

# helloIAm
source: Hello, I'm Federico! Android developer, Flutter enthusiast
it: Ciao, sono Federico! Android developer, Flutter enthusiast

# copiedWithEmoji
source: copied {emoji}
it: copiato 📋

# aboutMeSubtitle
source: Developer, lifelong learner and music lover. Born in '97. I lived in a little city of the south of Italy ðŸ‡®ðŸ‡¹, but now I'm based in Rome. I fell in love with the Android mobile development. At the moment I'm using Flutter to build cross, lovely and functional apps.
it: Sviluppatore, lifelong learner e amante della musica. Nato nel '97 in una piccola cittadina del sud Italia 🇮🇹, ma al momento vivo a Roma. Amo lo sviluppo mobile, ma in particolare adoro creare app Android. Al momento mi sto specializzando nello sviluppo di app tramite framework Flutter.

source: Experience
it: Esperienze

# windExperienceContent
source: Working into the IT Development team as App Developer. Technologies & Tools: Flutter, Git.
it: Lavoro nel reparto IT Development team come App Developer. Technologies & Tools: Flutter, Git.

# nttExperienceTitle
source: Mobile Developer @ NTT Data Italy
it: Mobile Developer @ NTT Data Italia

# nttExperienceContent
source: Worked into the "Mobile&Creative Technology" BSL as Digital Engineer. Clients: Enel X, Poste Italiane, Gewiss. Apps developed: JuicePass, YoUrban, ForFriends, NoiDiPoste Technologies & Tools: Flutter, Android w/ Java, Xamarin, Git, Jenkins, Jira
it: Ho lavorato per la business line "Mobile&Creative Technology". Clienti: Enel X, Poste Italiane, Gewiss. Applicazioni sviluppate: JuicePass, YoUrban, ForFriends, NoiDiPoste Tecnologie & strumenti: Flutter, Android w/ Java, Xamarin, Git, Jenkins, Jira

# vetryaExperienceContent
source: Projects: Vision app, Vilast, Corporate Campus App Technologies & Tools: Android w/ Java, React.Js, React Native
it: Progetti: Vision app, Vilast, Corporate Campus App Tecnologie & strumenti: Android w/ Java, React.Js, React Native

source: Education
it: Educazione

# elisCollegeEducationTitle
source: Post degree master @ ELIS College
it: Master post diploma @ ELIS College

# elisCollegeEducationContent
source: Thesis topic: Developing a web app with React.js and .NET infrastructure. Main subjects: Java SE 8, Java EE, Front-end and back-end frameworks, Mobile, Adobe Suite, UML and design patterns.
it: Tesi: Sviluppo di una web app con l'utilizzo di React.JS per il front-end e .NET per il back-end. Materie principali: Java SE 8, Java EE, Front-end and back-end frameworks, Mobile, Adobe Suite, UML e design patterns.

# universityEducationTitle
source: Computer Engineering Degree @ Uninettuno University
it: Ingegneria informatica @ Uninettuno University

# universityEducationContent
source: Thesis topic: Developing a mobile app using Flutter for charging EV. Main subjects: calculus, linear algebra, computer architecture, fundamentals of computer programming, structured and object-oriented programming, software engineering
it: Tesi: Sviluppo ed utilizzo di un’applicazione multipiattaforma per la ricarica di autoveicoli elettrici Materie principali: Analisi 1/2, computer architecture, fundamentals of computer programming, structured and object-oriented programming, software engineering

source: Certification
it: Certificazioni

source: Contacts
it: Contatti

# contactsHeading
source: Hi, thanks for visiting my personal website! If you want to reach me out, please use the following contacts:
it: Ciao, grazie per aver visitato il mio sito! In caso tu voglia contattarmi, usa uno dei seguenti recapiti:

# websiteMadeWith
source: Website made with {emoji} and Flutter
it: Website made with ❤️ and Flutter

# darkModeSelected
source: Activate light mode
it: Attiva light mode

# lightModeSelected
source: Activate dark mode
it: Attiva dark mode

source: Side projects
it: Altri progetti

# projectTwitchDescription
source: Wrapper for the newest Twitch API, available on pub.dev. It returns information about channels, media, search and game.
it: Wrapper per le nuove Twitch API, disponibile su pub.dev. Permette di recuperare e ricercare informazioni sui canali e media.

# projectSliderDescription
source: Creates slides from a json file. This tool will show a presentation that adapts to every screen resolution.
it: Crea slides da un file json. Questo strumento permette di creare una presentazione, la quale si adatta alle varie schermate.

# projectCovidBotDescription
source: Telegram Bot which get data from free API to show the latest update about COVID-19.
it: Bot Telegram che permette di recuperare le ultime informazioni sul Covid-19..

# projectJourneyDemoDescription
source: Prototype of journey planner using A* algorithm. Using OpenCharge API for retrieving CU data.
it: Prototitpo di un journey planner, che utilizza l'algoritmo A*. Utilizzo delle API OpenCharge per recuperare i dati delle stazioni di ricarica.

# projectCardStackDescription
source: A vertical dismissible and customizable stack of cards for a Flutter application.
it: Uno stack di card personalizzabili, per le tue app Flutter
